In [1]:
print('PandasOp')

PandasOp

In [2]:
import pandas as pd 
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                        'col1':[100,200,300,300,400,500],
                        'col2':['NY','CA','WA','WA','AK','NV']})

In [3]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [6]:
df_one['k1'].nunique()

3

In [7]:
df_one['col2'].value_counts()

WA    2
AK    1
NV    1
CA    1
NY    1
Name: col2, dtype: int64

In [8]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [9]:
df_one['NEW'] = df_one['col1']*10

In [10]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [11]:
def grab_first_letter(state):
    return state[0]

In [12]:
grab_first_letter('NY')

'N'

In [14]:
df_one['first letter']=df_one['col2'].apply(grab_first_letter)

In [15]:
df_one

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [16]:
def complex_letter(state):
    if state[0] == "W":
        return "Washington"
    else:
        return "Error"

In [17]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [18]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [19]:
my_map = {'A':1,'B':2,'C':3}

In [20]:
df_one['num'] = df_one['k1'].map(my_map)

In [24]:
df_one['col1'].idxmax()

5

In [27]:
df_one.columns = ['C1','C2','C3','C4','C5','C6']

In [28]:
df_one

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [29]:
pd.get_dummies(df_one['C1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1